Tekla Open API Reference for Tekla Structures 2025
ViewHandler.ZoomToBoundingBox Method (View, AABB)
Zooms a model view.
 Namespace: Tekla.Structures.Model.UI
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public static bool ZoomToBoundingBox(
	View view,
	AABB B
)
Public Shared Function ZoomToBoundingBox (
	view As View,
	B As AABB
) As Boolean
Parameters
view
Type: Tekla.Structures.Model.UI.View
The view that is to be zoomed.
B
Type: Tekla.Structures.Geometry3d.AABB
The bounding box the view is zoomed to.
Return Value
Type: Boolean
True on success.
See Also
Reference
ViewHandler Class
ZoomToBoundingBox Overload
Tekla.Structures.Model.UI Namespace